<template>
<main class="wrapper newsPage">
	<main-section :pageData="page" />
	<news-row :items="newsList" :eventsDelay="1400" noBtn />
	<map-section
		mapId="mapContacts"
		:coords="['31.16','59.95']"
		:mapZoom="10"
		class="mapContacts"
		data-aos="flip-down" 
	/>
</main>
</template>

<script>
import mainSection from './excursion/main-section';
import newsRow from './home/news-row';
import mapSection from './home/map-section';

export default {
	name: 'news',
	components: {
		mainSection,
		newsRow,
		mapSection
	},
	data: () => ({
		
		page: {
			title: 'Наши события',
			bg: require(`../assets/img/bg2.jpg`),
		},
		news: [
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
				img: 'yacht-wedding.jpg',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},
			{
				title: 'Осенняя свадьба на борту теплохода "Нефрит" 11.09.2017',
				text: 'Безусловно, день бракосочетания является одним из самых важных в жизни любого человека. Во-первых, это настоящий праздник любви ...',
				date: '04.11.2019',
			},

		],
	}),
    computed: {
		pageData() {
            if (!this.$store.state.page || !this.$store.state.page.Pubs ) return null;
            return this.$store.state.page.Pubs;
		},

		newsList() {
			if (!this.pageData) return null;

			return this.pageData.items;
		},
	},
	mounted() {
	}
}
</script>

<style lang="less">
@import "../less/variables";

.newsPage {
	.swiper-wrapper {
		flex-flow: wrap;
		transform: unset !important;
	}
	.swiper-container {
		padding-bottom: 20px;

		.up(@sm;{
			padding-bottom: 60px;
		});

	}

	.ourEvents {
		animation-delay: 1s;
	}

	.availableEvents {
		.swiper-pagination {
			display: none;
		}

		.el-button {
			display: block;
		}
	}
}
</style>