<template>
<main class="wrapper policyPage">
	<main-section :pageData="page" />
	<text-block
		:textDataL="pageData.FULL_1"
		:textDataR="pageData.FULL_2"
		class="white"
	/>
	<map-section
		mapId="mapContacts"
		:coords="['31.16','59.95']"
		:mapZoom="10.2"
		class="mapContacts"
		data-aos="flip-down" 
	/>
</main>
</template>

<script>
import mainSection from './excursion/main-section';
import textBlock from './elements/text-block';
import mapSection from './home/map-section';

export default {
	name: 'policy',
	components: {
		mainSection,
		textBlock,
		mapSection
	},
	data: () => ({
		policyText : [			
			{
				title: "Общие положения",
				text: {
					info: "Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных Невская Классика (далее – Оператор).Политикой.",
					items: [
						'Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.',
						'Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта http://site.com.',
					],
				},
			},
			{
				title: "Основные понятия, используемые в Политике",
				text: {
					info: "Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных Невская Классика (далее – Оператор).Политикой.",
					items: [
						'Оператор – государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;',
						'Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта http://site.com;',
						'Пользователь – любой посетитель веб-сайта http://site.com;',
						'Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц;',
						'Распространение персональных данных – любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом;',
						'Трансграничная передача персональных данных – передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу;',
						'Уничтожение персональных данных – любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и (или) результате которых уничтожаются материальные носители персональных данных.',
					],
				},
			},
		],
	}),
	computed: {
		pageData() {
            if (!this.$store.state.page || !this.$store.state.page.ConfirmPage) return null;
            return this.$store.state.page.ConfirmPage.content[0];
		},
		page() {
			return {
				title: 'Политика обработки персональных данных',
				bg: this.pageData.images[0],
			}
		},
	}
}
</script>
